src/test/resources/samples/request8.soap

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.integclaims.itf.com">
   <soapenv:Header/>
   <soapenv:Body>
        <ws:FindRefData soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <username xsi:type="xsd:string">webservice</username>
            <password xsi:type="xsd:string">password</password>
            <TABLE_NAME xsi:type="xsd:string">RD_TITLE</TABLE_NAME>
        </ws:FindRefData>
   </soapenv:Body>
</soapenv:Envelope>